Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: $GDIP_PXF16ARGB1555 - 16 bpp; 1 bit for alpha and 5 bits for each RGB component
fr: $GDIP_PXF16ARGB1555 - 16 bpp; 1 bit pour la composante de transparence and 5 bits pour chaque composante RVB

source: $GDIP_PXF24RGB - 24 bpp; 8 bits for each RGB
fr: $GDIP_PXF24RGB - 24 bpp; 8 bits pour chaque composante RVB

source: $GDIP_PXF32RGB - 32 bpp; 8 bits for each RGB.
fr: $GDIP_PXF32RGB - 32 bpp; 8 bits pour chaque composante RVB.

source: No alpha.
fr: Pas de composante de transparence

source: $GDIP_PXF32ARGB - 32 bpp; 8 bits for each RGB and alpha
fr: $GDIP_PXF32ARGB - 32 bpp; 8 bits pour chaque composante RVB et composante de transparence

source: $GDIP_PXF32PARGB - 32 bpp; 8 bits for each RGB and alpha, pre-multiplied
fr: $GDIP_PXF32PARGB - 32 bpp; 8 bits pour chaque composante RVB et composante de transparence, pré-multiplié

source: a $tagGDIPBITMAPDATA structure.
fr: Retourne une structure $tagGDIPBITMAPDATA

source: When you are done with the locked portion, call _GDIPlus_BitmapUnlockBits() to release the locked region.
fr: Lorsque vous en avez terminé avec la partie verrouillée, appelez _GDIPlus_BitmapUnlockBits() pour libérer le verrouillage de la partie de l'image.

source: Search GdipBitmapLockBits in MSDN Library
fr: Consultez GdipBitmapLockBits dans la Librairie MSDN.

source: X64 running support
fr: Support d'exécution X64

source: get AutoIt install dir
fr: Obtient le répertoire d'installation de AutoIt

source: create an image object based on a file
fr: Crée un objet d'image à partir d'un fichier

source: get width and height of the image
fr: Obtient la largeur et la hauteur de l'image

source: locks a portion of a bitmap for reading and writing.
fr: Verrouille une partie d'une image bitmap pour la lecture et l'écriture.

source: More infor at http://msdn.microsoft.com/en-us/library/windows/desktop/ms536298(v=vs.85).aspx
fr: Plus d'info à http://msdn.microsoft.com/en- us/library/windows/desktop/ms536298(v=vs.85).aspx

source: get scan0 (pixel data) from locked bitmap
fr: Obtient scan0 (données de pixels) à partir du bitmap verrouillé

source: color format 0xAARRGGBB
fr: Format de couleur 0xAARRVVBB

source: get each pixel in each line and row
fr: Obtient chaque pixel de chaque ligne et de chaque colonne

source: get pixel color
fr: Obtient la couleur des pixels

source: compare and replace pixel color (blue with transparent color)
fr: Compare et remplace la couleur des pixels (bleu avec la couleur transparente)

source: unlocks a portion of a bitmap that was locked by _GDIPlus_BitmapLockBits
fr: Déverrouille une partie d'une image bitmap qui a été verrouillée par _GDIPlus_BitmapLockBits

source: to save manipulated image just use _GDIPlus_ImageSaveToFile()
fr: Pour enregistrer l'image manipulée il suffit d'utiliser _GDIPlus_ImageSaveToFile()

source: display original image just to compare with manipulated one
fr: Affiche l'image originale juste pour comparer avec celle manipulée

source: display manipulated image
fr: Affiche l'image manipulée

source: create a Graphics object from a window handle
fr: Crée un objet Graphics à partir d'un handle de fenêtre

source: copy manipulated image to graphics handle
fr: Copie l'image manipulée dans le handle graphique

source: Sets the color of a specified pixel in this bitmap
fr: Définit la couleur d'un pixel spécifié dans un bitmap

source: The new color of the pixel
fr: La nouvelle couleur du pixel

source: Search GdipBitmapSetPixel in MSDN Library
fr: Consultez GdipBitmapSetPixel dans la Librairie MSDN.

source: extract red color channel
fr: Extrait le canal de couleur rouge

source: extract green color channel
fr: Extrait le canal de couleur vert

source: ;extract blue color channel
fr: Extrait le canal de couleur bleu

source: convert pixels to average greyscale color format
fr: Convertit les pixels au format de couleur niveaux de gris

source: set greyscaled pixel
fr: Définit le pixel en niveaux de gris

source: Unlocks a portion of a bitmap that was locked by _GDIPlus_BitmapLockBits
fr: Déverrouille une partie d'un bitmap qui a été verrouillée par _GDIPlus_BitmapLockBits

source: $tagGDIPBITMAPDATA structure previously passed to _GDIPlus_BitmapLockBits()
fr: Structure $tagGDIPBITMAPDATA précédemment transmise à _GDIPlus_BitmapLockBits

source: Search GdipBitmapUnlockBits in MSDN Library
fr: Consultez GdipBitmapUnlockBits dans la Librairie MSDN.

source: compare and replace pixel color (blue with black color)
fr: Compare et remplace la couleur des pixels (bleu avec la couleur noire)

source: Clone a Brush object
fr: Clone un pinceau

source: Handle to a Brush object
fr: Handle de l'objet Brush

source: a handle to a new brush object.
fr: Retourne le handle du nouvel objet pinceau.

source: When you are done with the Brush object, call _GDIPlus_BrushDispose() to release the resources.
fr: Lorsque vous en avez terminé avec l'objet pinceau, appelez _GDIPlus_BrushDispose() pour libérer les ressources.

source: Search GdipCloneBrush in MSDN Library
fr: Cherchez GdipCloneBrush dans la Library MSDN.

source: Create brushes
fr: Crée des pinceaux

source: Show brush information
fr: Affiche les informations sur les pinceaux

source: Write a line to the memo control
fr: Écrit une ligne dans le contrôle mémo

source: Create a solid Brush object
fr: Crée un pinceau d'une couleur unie

source: Alpha, Red, Green and Blue components of brush
fr: Composantes de la couleur du pinceau:Alpha, Rouge, Vert et Bleu

source: a handle to a solid Brush object.
fr: Retourne le handle du nouvel objet Brush.

source: Search GdipCreateSolidFill in MSDN Library
fr: Cherchez GdipCreateSolidFill dans la Library MSDN.

source: Release a Brush object
fr: Libère les ressources d'un pinceau

source: Search GdipDeleteBrush in MSDN Library
fr: Cherchez GdipDeleteBrush dans la Library MSDN.

source: Get the color of a Solid Brush object
fr: Obtient la couleur d'un pinceau de couleur unie

source: the brush color.
fr: Retourne la couleur du pinceau.

source: -1 and sets the @error flag to non-zero, @extended may contain GPSTATUS error code ($GPID_ERR*).
fr: Retourne -1 et @error <> 0, @extended contient le code erreur GPSTATUS ($GPID_ERR*).

source: Search GdipGetSolidFillColor in MSDN Library
fr: Cherchez GdipGetSolidFillColor dans la Library MSDN

source: Start GDIPlus
fr: Démarre GDIPlus

source: Create solid brush
fr: Crée un pinceau d'une seule couleur

source: Get solid brush color
fr: Obtient la couleurdu pinceau

source: Draw some graphics with the original brush color
fr: Dessine des graphiques avec la couleur du pinceau d'original

source: Set new brush color (0xFFFF0000 = Red)
fr: Définit un nouveau pinceau de couleur (0xFFFF0000 = rouge)

source: Get new solid brush color
fr: Obtient la nouvelle couleur du pinceau

source: Draw some graphics with the new brush color
fr: Dessine des graphiques avec la nouvelle couleur du pinceau

source: Write original brush color to Label1
fr: Ecrit avec la couleur du pinceau d'origine dans Label1

source: Write the new brush color to Label2
fr: Ecrit avec la nouvelle couleur du pinceau dans label2

source: Retrieve the type of Brush object
fr: Récupére le type d'un pinceau

source: the brush type:
fr: Retourne le type de pinceau:

source: 0 - Solid color
fr: 0 - Remplissage avec une couleur unie

source: 1 - Hatch fill
fr: 1 - Remplissage avec hachures

source: 2 - Texture fill
fr: 2 - Remplissage avec texture (image)

source: 3 - Path gradient
fr: 3 - Remplissage avec dégradé de l'intérieur d'un GraphicsPath

source: 4 - Linear gradient
fr: 4 - Remplissage avec un dégradé linéaire

source: Search GdipGetBrushType in MSDN Library
fr: Cherchez GdipGetBrushType dans la Library MSDN.

source: Set the color of a Solid Brush object
fr: Définit la couleur d'un pinceau de couleur unie

source: Search GdipSetSolidFillColor in MSDN Library
fr: Cherchez GdipSetSolidFillColor dans la Library MSDN.

source: Get solid brush original color
fr: Obtient la couleur du pinceau d'origine d'origine

source: Get solid brush new color
fr: Obtient la nouvelle couleur du pinceau

source: Creates and initializes an identity color matrix
fr: Crée et initialise une matrice couleur identité

source: Returns a $tagGDIPCOLORMATRIX structure.
fr: Retourne une structure $tagGDIPCOLORMATRIX.

source: An identity color matrix is a color matrix that does nothing.No color transformation, shearing, scaling, ...
fr: Une matrice couleur identité est une transformation qui ne fait rien, aucune modification de couleur.

source: $tagGDIPCOLORMATRIX()
fr: Lien

source: Search ColorMatrix in MSDN Library
fr: Voir aussi

source: create an ImageAttribute object
fr: Crée un objet graphique à partir d'un handle fenêtre

source: create color matrix
fr: Crée un objet ImageAttribute

source: manipulate some values in the color matrix
fr: Crée une matrice de couleur

source: adapt the modified color matrix
fr: Manipule quelques valeurs dans la matrice de couleur

source: draw the bitmap while applying the color adjustment
fr: Adapte la matrice de couleur modifiée

source: Creates and initializes a gray-scaling color matrix
fr: Crée et initialise une matrice couleur niveaux de gris

source: Returns a $tagGDIPCOLORMATRIX structure defining a gray-scaling color matrix.
fr: Une matrice couleur 'niveaux de gris' transforme une couleur quelconque en un niveau de gris caractérisé par le même pourcentage de rouge, vert, bleu.Les coefficients d'une telle matrice sont adaptés à la sensibilité de l'oeil humain, voici un exemple:

source: create greyscale color matrix
fr: Crée un objet ImageAttribute

source: set greyscale color matrix
fr: Crée une matrice couleur niveaux de gris

source: Creates and initializes a negative color matrix
fr: Crée et initialise une matrice couleur qui transforme une couleur en son négatif

source: create negative color matrix
fr: Crée un objet ImageAttribute

source: set negative color matrix
fr: Crée matrice de négatif couleur

source: Creates and initializes a saturation color matrix
fr: Crée et initialise une matrice couleur saturation

source: Color saturation factor
fr: Facteur de saturation de couleur

source: Returns a $tagGDIPCOLORMATRIX structure that contains a saturation color matrix.
fr: Retourne une structure $tagGDIPCOLORMATRIX qui contient une matrice couleur de saturation.

source: A saturation factor of 0 produces a gray-scaled image.
fr: Un facteur de saturation de 0 produit une image en niveaux de gris.

source: create saturation color matrix
fr: Crée une matrice couleur de saturation

source: set saturation color matrix
fr: Installe la matrice couleur de saturation

source: Creates and initializes a scaling color matrix
fr: Crée et initialise une matrice couleur de mise à niveaux

source: Red component scaling factor
fr: Facteur de la composante Rouge de la mise à niveau

source: Green component scaling factor
fr: Facteur de la composante Vert de la mise à niveau

source: Blue component scaling factor
fr: Facteur de la composante Bleu de la mise à niveau

source: [optional]Alpha component scaling factor
fr: [optionnel]Facteur de la composante Alpha de la mise à niveau

source: Returns a $tagGDIPCOLORMATRIX structure that contains a scaling color matrix.
fr: Retourne une structure $tagGDIPCOLORMATRIX qui contient une matrice couleur de mise à niveau.

source: A scaling color matrix is used to multiply components of a color by multiplier factors.
fr: Une matrice couleur de mise à niveaux est utilisée pour multiplier les trois composantes d'une couleur par trois coefficients.

source: create the scale factor color matrix for RGB color channel
fr: Crée la matrice couleur de mise à niveaux avec des facteurs 0.5

source: decrease each color (RGB) level by 50% (darken)
fr: Diminue le niveau de chaque couleur (RVB) de 50% (assombrit)

source: Creates and initializes a translation color matrix
fr: Crée et initialise une matrice couleur de translation

source: Red component translation factor
fr: Composante Rouge de la translation

source: Green component translation factor
fr: Composante Vert de la translation

source: Blue component translation factor
fr: Composante Bleu de la translation

source: Alpha component translation factor
fr: Composante Alpha de la translation

source: Returns a $tagGDIPCOLORMATRIX structure that contains a translation color matrix.
fr: Retourne une structure $tagGDIPCOLORMATRIX qui contient une matrice couleur de translation.

source: A translation color matrix is used to increase or decrease components of a color by addition factors.
fr: Une matrice couleur de translation est utilisée pour augmenter ou diminuer les composantes d'une couleur par des constantes additives.

source: create the brightness color matrix (RGB)
fr: Crée la matrice qui modifie la luminosité des couleurs (RVB)

source: adjust the image brightness to be 75% brighter
fr: Ajuste la luminosité de l'image à 75 % plus lumineux

source: Clones a CustomLineCap object
fr: Clone un objet embout personnalisé de ligne (CustomLineCap)

source: Pointer to a CustomLineCap object
fr: Pointeur vers un objet CustomLineCap

source: a handle to the cloned CustomLineCap object.
fr: le handle de l'objet CustomLineCap cloné.

source: When you are done with the CustomLineCap object, call _GDIPlus_CustomLineCapDispose() to release the resources.
fr: Lorsque vous en avez terminé avec l'objet CustomLineCap, appelez _GDIPlus_CustomLineCapDispose() pour libérer les ressources.

source: Search GdipCloneCustomLineCap in MSDN Library
fr: Cherchez GdipCloneCustomLineCap dans la Library MSDN.

source: Initialize GDI+
fr: Initialise GDI +

source: Create GraphicsPath and add two lines to it.
fr: Crée un GraphicsPath et lui ajoute deux lignes.

source: Create a CustomLineCap object.
fr: Crée un objet CustomLineCap.

source: Create a clone CustomLineCap object.
fr: Crée un objet clone de CustomLineCap.

source: Create a Pen object, assign cloned cap as the custom end cap, and draw a line.
fr: Crée un objet Pen, assigne la pointe clonée à l'embout personnalisé, et trace une ligne.

source: Clean up
fr: Nettoie

source: Uninitialize GDI+
fr: Arrête GDI+

source: Release a custom line cap object
fr: Libère un objet embout de ligne personnalisé

source: Handle to a custom line cap object
fr: Handle de l'objet embout de ligne personnalisé

source: False and sets the @error flag to non-zero, @extended may contain GPSTATUS error code (GDIP_ERR*).
fr: Faux et @error <> 0, @extended contient le code erreur GPSTATUS (GDIP_ERR *).

source: Gets the end cap styles for both the start line cap and the end line cap
fr: Obtient les styles d'embout à la fois pour le début et pour la fin de la ligne

source: an array with the following format:
fr: un tableau avec le format suivant :

source: [0] - Start line cap style
fr: [0] - Style de l'embout de début de ligne

source: [1] - End line cap style
fr: [1] - Style de l'embout de fin de ligne

source: Search GdipGetCustomLineCapStrokeCaps in MSDN Library
fr: Cherchez GdipGetCustomLineCapStrokeCaps dans la Library MSDN.

source: Get an array of information about the available image decoders
fr: Obtient un tableau d'informations sur les décodeurs d'images disponibles

source: [0][ 0] - Number of decoders
fr: [0] [ 0] - Nombre de décodeurs

source: [1][ 1] - Codec identifier
fr: [1] [ 1] - Identifiant du codec

source: [1][ 2] - File format identifier
fr: [1] [ 2] - Identifiant du format de fichier

source: [1][ 3] - Codec name
fr: [1] [ 3] - Nom du codec

source: [1][ 4] - DLL in which the code resides
fr: [1] [ 4] - DLL dans laquelle le code réside

source: [1][ 5] - The name of the file format used by the codec
fr: [1] [ 5] - Le nom du format de fichier utilisé par le codec

source: [1][ 6] - Filename extensions associated with the codec
fr: [1] [ 6] - Les extensions de nom de fichier associées au codec

source: [1][ 7] - The mime type of the codec
fr: [1] [ 7] - Le type mime du codec

source: [1][ 8] - Combination of $GDIP_ICF flags
fr: [1] [ 8] - Combinaison de flags $GDIP_ICF

source: [1][ 9] - The version of the codec
fr: [1] [ 9] - La version du codec

source: [1][10] - The number of signatures used by the file format
fr: [1] [10] - Le nombre de signatures utilisées par le format de fichier

source: [1][11] - The number of bytes in each signature
fr: [1] [11] - Le nombre d'octets dans chaque signature

source: [1][12] - Pointer to the pattern for each signature
fr: [1] [12] - Pointeur vers le motif de chaque signature

source: [1][13] - Pointer to the mask for each signature
fr: [1] [13] - Pointeur sur le masque pour chaque signature

source: sets the @error flag to non-zero, @extended may contain GPSTATUS error code (GDIP_ERR*).
fr: Retourne @error <> 0, @extended contient le code erreur GPSTATUS (GDIP_ERR*).

source: Search GdipGetImageDecoders in MSDN Library
fr: Consultez GdipGetImageDecoders dans la Librairie MSDN.

source: Create an image to use for paramater lists
fr: Crée une image à utiliser avec les listes de paramètres

source: Show encoder parameters
fr: Affiche les paramètres de l'encodeur

source: Show decoder parameters
fr: Affiche les paramètres de décodage

source: Show encoder information
fr: Affiche les informations du codeur

source: Get the number of available image decoders
fr: Obtient le nombre de décodeurs d'image disponibles

source: the number of image decoders.
fr: Retourne le nombre de décodeurs d'image.

source: -1 and sets the @error flag to non-zero, @extended may contain GPSTATUS error code (GDIP_ERR*).
fr: Retourne -1 et @error <> 0, @extended contient le code erreur GPSTATUS (GDIP_ERR*).

source: Search GdipGetImageDecodersSize in MSDN Library
fr: Consultez GdipGetImageDecodersSize dans la Librairie MSDN.

source: Show number of decoders/encoders
fr: Affiche le nombre de décodeurs/encodeurs

source: Get the total size of the structure that is returned by _GDIPlus_GetImageDecoders
fr: Obtient la taille totale de la structure qui est retournée par _GDIPlus_GetImageDecoders

source: the total size, in bytes.
fr: Retourne la taille totale en octets.

source: Draws a portion of an image after applying a specified effect
fr: Dessine une partie d'une image après l'application d'un effet spécifié

source: Handle to a Graphics object.
fr: Handle de l'objet Graphics.

source: Handle to an Image object.
fr: Handle de l'objet Image.

source: Handle to an Effect that is applied to the image before rendering.
fr: Handle de l'objet Effect qui est appliqué à l'image avant le rendu.

source: The image is not permanently altered by the effect.
fr: L'image n'est pas modifiée de façon permanente par l'effet.

source: $tagGDIPRECTF structure that specifies the portion of the image to be drawn.
fr: Structure $tagGDIPRECTF qui spécifie la partie de l'image à dessiner.

source: Handle to a Matrix object that specifies the parallelogram in which the image portion is rendered.
fr: Handle de l'objet Matrix qui spécifie le parallélogramme dans lequel la partie de l'image est rendue.

source: Handle to an ImageAttributes object that specifies color adjustments to be applied when the image is rendered.
fr: Handle de l'objet ImageAttributes qui spécifie les réglages de couleur à appliquer dans le rendu de l'image.

source: Specifies the unit of measure for the image.
fr: Spécifie l'unité de mesure pour l'image.

source: Search GdipDrawImageFX in MSDN Library
fr: Consultez GdipDrawImageFX dans la Librairie MSDN.

source: X coordinate of upper left hand corner of the portion of the image to be drawn.
fr: Coordonnée X du coin supérieur gauche de la partie de l'image à dessiner.

source: Width of the portion rectangle of the image to be drawn.
fr: Largeur du rectangle de la partie de l'image à dessiner.

source: Height of the portion rectangle of the image to be drawn.
fr: Hauteur du rectangle de la partie de l'image à dessiner.

source: Draws an image at a specified location
fr: Dessine une image à un emplacement spécifié

source: Handle to an Image object
fr: Handle de l'objet Image

source: The X coordinate of the upper left corner of the source image
fr: La coordonnée X du coin supérieur gauche de l'image source

source: The Y coordinate of the upper left corner of the source image
fr: La coordonnée Y du coin supérieur gauche de l'image source

source: The X coordinate of the upper right corner of the source image
fr: La coordonnée X du coin supérieur droit de l'image source

source: The Y coordinate of the upper right corner of the source image
fr: La coordonnée Y du coin supérieur droit de l'image source

source: The X coordinate of the lower left corner of the source image
fr: La coordonnée X du coin inférieur gauche de l'image source

source: The Y coordinate of the lower left corner of the source image
fr: La coordonnée Y du coin inférieur gauche de l'image source

source: Specifies the number of points (x,y)'s in the structure.
fr: Le nombre de points (x, y) de la structure.

source: The value of the count parameter must equal 3 to specify the coordinates of the upper-left corner, upper-right corner, and lower-left corner of the parallelogram.
fr: La valeur du paramètre $iCount doit être égal à 3 pour spécifier les coordonnées du coin supérieur gauche, coin supérieur droit, et le coin inférieur gauche du parallélogramme.

source: The coordinate of the lower-right corner, the width, and the height of the image, are calculated using the three given coordinates.
fr: La coordonnée du coin en bas à droite, la largeur et la hauteur de l'image, sont calculés à l'aide des trois coordonnées données.

source: The image is scaled to fit the parallelogram.
fr: L'image est redimensionnée à la taille du parallélogramme.

source: Search GdipDrawImagePoints in MSDN Library
fr: Consultez GdipDrawImagePoints dans la Librairie MSDN.

source: Capture full screen
fr: Capture l'écran complet

source: Capture screen region
fr: Capture une région d'écran

source: Draw one image in another
fr: Dessine une image dans une autre

source: Draw a frame around the inserted image
fr: Dessine un cadre autour de l'image insérée

source: Save resultant image
fr: Enregistre l'image résultante

source: Creates an Effect object of the type specified by the guid parameter
fr: Crée un objet Effect du type spécifié par le paramètre guid

source: Effect Guid constant that specifies the kind of effect to create.
fr: Constante Guid de l'effet qui spécifie le type d'effet à créer.

source: a handle to an Effect object.
fr: Retourne le handle de l' objet Effect.

source: Search GdipCreateEffect in MSDN Library
fr: Consultez GdipCreateEffect dans la Librairie MSDN.

source: Creates a Blur class effect object
fr: Crée un objet Effect qui agit sur le flou

source: Real number that specifies the blur radius (the radius of the Gaussian convolution kernel) in pixels.
fr: Nombre réel qui spécifie le rayon de flou (le rayon du noyau de convolution gaussien) en pixels.

source: The radius must be in the range 0.0 through 255.0.
fr: Le rayon doit être compris entre 0,0 et 255,0.

source: Boolean value that specifies whether the bitmap expands by an amount equal to the blur radius.
fr: Valeur booléenne pour indiquer si la taille du bitmap augmente d'un montant égal au rayon de flou.

source: If TRUE, the bitmap expands by an amount equal to the radius so that it can have soft edges.
fr: Si TRUE, l'image bitmap se dilate d'un montant égal au rayon de sorte qu'il peut y avoir des bords flous.

source: If FALSE, the bitmap remains the same size and the soft edges are clipped.
fr: Si FALSE, le bitmap reste à la même taille et les contours flous sont tronquées.

source: Creates a ColorBalance class effect object
fr: Crée un objet Effect qui agit sur la balance des couleurs
